DataProcessors/МониторСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МониторСверкиВзаиморасчетов/Forms/СостояниеСверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = Параметры.Организация;
	Объект.НачалоПериода = Параметры.НачалоПериода;
	Объект.КонецПериода = Параметры.КонецПериода;
	Контрагент = Параметры.Контрагент;
	ТипыРасчетов = Новый ФиксированныйМассив(Параметры.ТипыРасчетов);
	УчастникЭДО = Параметры.УчастникЭДО;
	Валюта = Параметры.Валюта;
	ВключатьДоговорыБезОборотов = Параметры.ВключатьДоговорыБезОборотов;
	
	ПараметрыСверки = ПараметрыСверки();
	Обработка = РеквизитФормыВЗначение("Объект");
	ДанныеОтчета = Обработка.СформироватьРасшифровку(ПараметрыСверки);
	АдресДанныхРасшифровки = ДанныеОтчета.АдресДанныхРасшифровки;
	
	РезультатОтчета.Вывести(ДанныеОтчета.Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеРасшифровки = ПолучитьЗначениеДляОткрытия(Расшифровка);
	//++ Локализация
	Если ЗначениеРасшифровки = "ОтчетСверка20" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Отбор", Новый Структура);
		ПараметрыФормы.Вставить("НачалоПериода", Объект.НачалоПериода);
		ПараметрыФормы.Вставить("КонецПериода", Объект.КонецПериода);
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Контрагент", Контрагент);
		ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
		ОткрытьФорму("Отчет.СверкаРасчетовСКонтрагентами.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		Возврат;
		
	КонецЕсли;
	//-- Локализация
	
	Если ЗначениеРасшифровки <> Неопределено Тогда
		ПоказатьЗначение(, ЗначениеРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыСверки()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НачалоПериода", Объект.НачалоПериода);
	Результат.Вставить("КонецПериода", КонецДня(Объект.КонецПериода));
	Результат.Вставить("Организация", Объект.Организация);
	Результат.Вставить("Контрагент", Контрагент);
	Результат.Вставить("Менеджер", Менеджер);
	Результат.Вставить("ТолькоНашиОрганизации", Ложь);
	Результат.Вставить("ТипыРасчетов", ТипыРасчетов);
	Результат.Вставить("УчастникЭДО", УчастникЭДО);
	Результат.Вставить("Валюта", Валюта);
	Результат.Вставить("ВключатьДоговорыБезОборотов", ВключатьДоговорыБезОборотов);
	ВалютаРегл = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация);
	Результат.Вставить("ЭтоВалютаРегл", Валюта = ВалютаРегл);
	Результат.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеДляОткрытия(Расшифровка)
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Расшифровка)) Тогда
		Возврат Расшифровка;
	КонецЕсли;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);//ДанныеРасшифровкиКомпоновкиДанных
	ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля();
	Если ПоляРасшифровки.Количество() > 0 Тогда
		ЗначениеРасшифровки = ПоляРасшифровки[0].Значение;
		Если ЭлементРасшифровки.ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
			Возврат ЗначениеРасшифровки;
		КонецЕсли;
		
		Если ЗначениеРасшифровки = Null
			Или ЗначениеРасшифровки = Неопределено
			Или ТипЗнч(ЗначениеРасшифровки) = Тип("Число")
			Или ТипЗнч(ЗначениеРасшифровки) = Тип("Строка")
			Или ТипЗнч(ЗначениеРасшифровки) = Тип("Булево") Тогда
			Возврат Неопределено;
		Иначе
			Возврат ЗначениеРасшифровки;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
